app/controllers/account_controller.rb

INSERT INTO `users` (`address1`, `city`, `created_on`, `salt`, `address2`, `postal_code`, `activated_at`, `crypted_password`, `updated_on`, `country`, `remember_token_expires_at`, `activation_code`, `password_reset_code`, `phone`, `remember_token`, `num_requests_filled`, `num_request_made`, `first_name`, `last_name`, `password`, `login`, `email`, `state`) VALUES(NULL, NULL, '2010-08-01 20:32:24', 'b3c71dc01da045d39f8e9988b5868cab3c4220f4', NULL, NULL, NULL, '29a711f0c6f77f48e6628468a87a4a1ad70a9864', '2010-08-01 20:32:24', NULL, NULL, 'b01077515fefe18ac8d23c103c3b12f8ee029af5', NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, 'rainsrg', 'rainsrg@comcast.net', NULL)
---
  def signup
    @user = User.new(params[:user])
    return unless request.post?
    @user.save!

SELECT * FROM `users` WHERE (`users`.`activation_code` = 'b01077515fefe18ac8d23c103c3b12f8ee029af5') LIMIT 1
---
  def activate
	@user = User.find_by_activation_code(params[:id])

SELECT `users`.id FROM `users` WHERE (LOWER(`users`.`email`) = BINARY 'weezee49@yahoo.com' AND `users`.id <> 14) LIMIT 1
UPDATE `users` SET `updated_on` = '2010-08-01 19:31:29', `password_reset_code` = 'e2c54b4e3e76047288a3af11b5fa708df79975bf' WHERE `id` = 14
---
  def forgot_password
    return unless request.post?
    if @user = User.find_by_email(params[:email])
      @user.forgot_password
      @user.save