app/controllers/exchanges_controller.rb

    def new
        @listing = Listing.find(params[:id])
        @user = current_user
        @owner = User.find(@listing.user_id)
---
SELECT * FROM `listings` WHERE (`listings`.`id` = 4)
SELECT * FROM `users` WHERE (`users`.`id` = 14) LIMIT 1

    def create
        if params[:commit].eql?('Cancel')
            redirect_to :controller => :listings, :action => :view, :id => params[:id]
        else
            #the button pushed was submit - create the new exchange
            @listing = Listing.find(params[:id])
            @user = current_user
            @owner = User.find(@listing.user_id)

            @exchange = Exchange.new(params[:exchange])
            @exchange.status = "open"
            @exchange.listing_id = @listing.id
			@exchange.cost = @listing.cost_of_exchange
            #print "\n\n\n***#{@user.first_name}***\n\n\n"
            if @listing.listing_type.downcase.eql?('request')
                @exchange.provider_id = @user.id
                @exchange.recipient_id = @owner.id
            else    #it's an offer
                @exchange.provider_id = @owner.id
                @exchange.recipient_id = @user.id
            end

            #the status of @listing needs to be updated to 'in_exchange'
            @listing.status = "in_exchange"

            #wrap the saves and updates in a transaction - if one fails they all need to fail

            Exchange.transaction do
                #update the listing
                @listing.update_attributes!(params[:listing])
                @exchange.save!
---
SELECT * FROM `listings` WHERE (`listings`.`id` = 4)
SELECT * FROM `users` WHERE (`users`.`id` = 14) LIMIT 1
UPDATE `listings` SET `status` = 'in_exchange', `updated_on` = '2010-08-01 19:52:30' WHERE `id` = 4
INSERT INTO `exchanges` (`status`, `created_on`, `cost`, `provider_id`, `comments`, `updated_on`, `listing_id`, `recipient_id`, `funds_xfr`) VALUES('open', '2010-08-01 19:52:30', 9.0, 12, 'Beautiful work!', '2010-08-01 19:52:30', 4, 14, NULL)

    def view
        #when a member needs to view and accept an exchange
        @exchange = Exchange.find(params[:id])
        @provider = User.find(@exchange.provider_id)
        @recipient = User.find(@exchange.recipient_id)
        @listing = Listing.find(@exchange.listing_id)
---
SELECT * FROM `exchanges` WHERE (`exchanges`.`id` = 47)
SELECT * FROM `users` WHERE (`users`.`id` = 14) LIMIT 1
SELECT * FROM `listings` WHERE (`listings`.`id` = 127)

    def accept
         if params[:commit].eql?('Not Yet')
            redirect_to :controller => :listings, :action => :view, :id => Exchange.find(params[:id]).listing_id
         elsif params[:commit].eql?('Back')
			redirect_to :action => :list
		 else
            exchange = Exchange.find(params[:id])
			#print "\n\n\n***96-#{exchange.listing_id}***\n\n\n"
             listing = Listing.find(exchange.listing_id)
            listing.status = "complete"
            exchange.status = "complete"

            Exchange.transaction do
                #update the listing
                listing.update_attributes!(params[:listing])
---
SELECT * FROM `exchanges` WHERE (`exchanges`.`id` = 47)
SELECT * FROM `listings` WHERE (`listings`.`id` = 127)
UPDATE `exchanges` SET `status` = 'complete', `funds_xfr` = 0, `updated_on` = '2010-08-01 20:55:48' WHERE `id` = 47
UPDATE `listings` SET `status` = 'complete', `updated_on` = '2010-08-01 20:55:48' WHERE `id` = 127

    def ratings
        #called when clicking on one of the pink spools to give a rating.
        #the params[:id] is the exchange.listing_id and the params[:format] is the
        #rating.

        exchange = Exchange.find(params[:id])
---
SELECT * FROM `exchanges` WHERE (`exchanges`.`id` = 47)