app/controllers/listings_controller.rb

SELECT * FROM `listings` WHERE (user_id = 14) ORDER BY type
---
	def list
        @user = current_user
        @listings = Listing.find(:all, :conditions=> ["user_id = ?", @user.id], :order => :type)

INSERT INTO `listings` (`status`, `image_url`, `created_on`, `magazine_name`, `block_pattern_name`, `number`, `kit_magazine_name`, `theme`, `updated_on`, `magazine_month`, `magazine_issue`, `type`, `kit_magazine_issue`, `pattern`, `description`, `length`, `manufacturer`, `cost_per_yard`, `treated`, `complete`, `finished_width`, `cost_of_exchange`, `user_id`, `treatment_method`, `finished_length`, `magazine_year`, `color_list`, `fabric_designer`, `kit_pattern_included`, `fabric_type`, `listing_type`, `width`, `fabric_line_name`) VALUES('new', NULL, '2010-08-01 19:45:23', 'Fons and Porter', NULL, NULL, NULL, NULL, '2010-08-01 19:45:23', NULL, '2006-01-01 00:00:00', 'Magazine', NULL, NULL, 'I need the Sew Crazy instructions for iron-on pictures', NULL, NULL, NULL, NULL, NULL, NULL, NULL, 14, NULL, NULL, NULL, NULL, NULL, NULL, NULL, 'request', NULL, NULL)
SELECT * FROM `users` WHERE (`users`.`id` = 14) LIMIT 1
---
	def create
		 if params[:commit].eql?('Cancel')
            redirect_to :controller => :listings, :action => :list
        else
	        #run after the submit button is pressed
	        #print "\n\n\n***#{params[:format]}***\n\n\n" #---- it's a string
	        @listing = case params[:id]
	                when "1": Yardage.new(params[:listing])
	                when "2": Block.new(params[:listing])
	                when "3": Kit.new(params[:listing])
	                when "4": Magazine.new(params[:listing])
	                when "5": QuiltTop.new(params[:listing])
	            end #case

	        #@listing = Listing.new(params[:listing])
	        @listing.user_id = current_user.id
			@listing.status = 'new'
	        #now handle the listing_image
	        @listing_image = ListingImage.new(params[:listing_image])
	        @listing_image.listing_id = @listing.id
	        # get the join class item - color
	       if params[:colors] && params[:colors].size > 0
	            color_ids = params[:colors]
	            color_ids.each {|c| @listing.colors << Color.find(c) }

SELECT * FROM `listing_images` WHERE (`listing_images`.`id` = 15)
---
   def listing_image

		@listing_image = ListingImage.find(params[:id])

SELECT * FROM `listings` WHERE (`listings`.`id` = 32)
---
	def edit
        @listing = Listing.find(params[:id])

SELECT * FROM `listings` WHERE (`listings`.`id` = 28)
SELECT * FROM `colors` INNER JOIN `colors_listings` ON `colors`.id = `colors_listings`.color_id WHERE (`colors_listings`.listing_id = 28 )
SELECT * FROM `listing_images` WHERE (listing_id = 28)
DELETE FROM `listing_images` WHERE `id` = 12
UPDATE `listings` SET `updated_on` = '2010-08-01 19:17:30', `magazine_issue` = '2007-11-01 00:00:00' WHERE `id` = 28
---
	def update

        if params[:commit].eql?('Cancel')
            redirect_to :controller => :listings, :action => :list
        else
            @listing = Listing.find(params[:id])

            #remove all the colors then add the checked ones back in
            @colors = @listing.colors
            #print "\n\n\n***the listing's colors should be #{@colors}***\n\n\n"
            Listing.transaction do
               @colors.each{|c| @listing.colors.delete(Color.find(c))}

               #now add back the checked colors
               if params[:colors] && params[:colors].size > 0
        			params[:colors].each{|c| @listing.colors << Color.find(c)}
        		end



                #if there is a new uploaded_picture listing_image[uploaded_picture]
                # delete the old one and add in the new one
                unless params[:listing_image][:uploaded_picture].blank?
                    #print "\n\n\n***140 #{@listing.id} ***\n\n\n"
                    pix_to_delete = ListingImage.find(:all,
                            :conditions => ["listing_id = ?", @listing.id])
                    #print "\n\n\n***142 #{pix_to_delete.size}***\n\n\n"
                    pix_to_delete.each{|e| e.destroy}
                    @listing_image = ListingImage.new(params[:listing_image])
                    #next line needs to be there so that the image's id gets updated
                    @listing_image.listing = @listing
                    @listing_image.save!

SELECT * FROM `listings` WHERE (user_id != 14 and status = 'new') ORDER BY type LIMIT 0, 4
SELECT count(listings.id) AS count_listings_id FROM `listings` WHERE (user_id != 14 and status = 'new')
---
    def browse
        #@listings = Listing.find(:all, :order => "type")
        @user = current_user
        @listings = Listing.find(:all,
                    :conditions => ["user_id != ? and status = 'new'",@user.id ],
                    :order => :type,
                    :page => {:size => 4, :current => params[:page]})

SELECT * FROM `listings` WHERE (`listings`.`id` = 4)
---
    def view
        @listing = Listing.find(params[:id])

SELECT * FROM `listings` WHERE (`listings`.`id` = 28)
DELETE FROM `listings` WHERE `id` = 28
SELECT * FROM `colors` INNER JOIN `colors_listings` ON `colors`.id = `colors_listings`.color_id WHERE (`colors_listings`.listing_id = 28 )
SELECT * FROM `listing_images` WHERE (listing_id = 28)
DELETE FROM `listing_images` WHERE `id` = 12
---
    def remove
        listing = Listing.find(params[:id])
        #remove colors

        colors = listing.colors
        colors.each{|c| listing.colors.delete(Color.find(c))}

        #delete the listing_image
        listing_image = ListingImage.find(:all, :conditions => ["listing_id = ?", listing.id])
        #get back an array, there should only be one element in it
        if listing_image.length == 1
            listing_image[0].destroy