app/controllers/users_controller.rb

UPDATE `users` SET `city` = 'Billerica', `last_name` = 'Rains', `first_name` = 'Bob', `address2` = '', `updated_on` = '2010-08-01 20:45:12', `address1` = '12 Pinehurst Ave.', `state` = 'MA', `postal_code` = '01821' WHERE `id` = 19
---
  def update

	#print "\n\n***********#{params[:user][:id]}**********\n\n"
    if params[:commit].eql?('Cancel')
        redirect_to :controller => :welcome
    else
    	user = current_user
    	if user.update_attributes(params[:user])